{"format": "graph-model", "generatedBy": "2.16.2", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"outputs": {"RNA_1/output_1/Softmax": {"name": "RNA_1/output_1/Softmax"}}}, "modelTopology": {"node": [{"name": "RNA_1/hidd_1_1/Cast/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "RNA_1/hidd_1_1/Add/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}}}, {"name": "RNA_1/output_1/Cast/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "RNA_1/output_1/Add/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, {"name": "RNA_1/hidd_1_1/Add", "op": "_FusedMatMul", "input": ["x", "RNA_1/hidd_1_1/Cast/ReadVariableOp/resource", "RNA_1/hidd_1_1/Add/ReadVariableOp/resource"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "RNA_1/output_1/Add", "op": "_FusedMatMul", "input": ["RNA_1/hidd_1_1/Add", "RNA_1/output_1/Cast/ReadVariableOp/resource", "RNA_1/output_1/Add/ReadVariableOp/resource"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "RNA_1/output_1/Softmax", "op": "Softmax", "input": ["RNA_1/output_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "RNA_1/hidd_1_1/Cast/ReadVariableOp/resource", "shape": [4, 12], "dtype": "float32"}, {"name": "RNA_1/hidd_1_1/Add/ReadVariableOp/resource", "shape": [12], "dtype": "float32"}, {"name": "RNA_1/output_1/Cast/ReadVariableOp/resource", "shape": [12, 4], "dtype": "float32"}, {"name": "RNA_1/output_1/Add/ReadVariableOp/resource", "shape": [4], "dtype": "float32"}]}]}